DataProcessors/ВыгрузкаАБанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаАБанк</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлDBF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PAYERIDENT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FIO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>STREETCODE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>STREET</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BUILDING</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FLAT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>COMPANY</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OKPO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>COMPANYCOD</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PHONE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ACCOUNT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>34</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MFO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SERVICE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SERVICECOD</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LS</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PAYDEST</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>160</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CASHSYMBOL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MGTARIF_S</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SUM</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>YEAR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MONTH</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DEBT</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CHARGE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RECALC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>REMISSION</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SUBSIDIES</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDMET1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EVAL1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LASTPAY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаселенныйПункт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДома</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКорпуса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВыгрузкаАБанк/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлDBFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл XBase (*.dbf)|*.dbf'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "dbf";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.ФайлDBF = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.ДанныеДляВыгрузки.Очистить();
	Условие = "";
	Условие1 = "";
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(Услуги) Тогда
		Условие = Условие + "И Услуга В ИЕРАРХИИ (&Услуги)";
		Условие1 = Условие1 + "И РасчетыПоЛицевымСчетам.Услуга В ИЕРАРХИИ (&Услуги)";
		Запрос.УстановитьПараметр("Услуги", Услуги);
	КонецЕсли;
	Запрос.Текст =
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	ВложенныйЗапрос.OKPO,
	   |	ВложенныйЗапрос.LS,
	   |	СУММА(ВложенныйЗапрос.DEBT) КАК DEBT,
	   |	СУММА(ВложенныйЗапрос.CHARGE) КАК CHARGE,
	   |	СУММА(ВложенныйЗапрос.LASTPAY) КАК LASTPAY,
	   |	ВложенныйЗапрос.COMPANY,
	   |	ВложенныйЗапрос.ACCOUNT,
	   |	СУММА(ВЫБОР
	   |			КОГДА ВложенныйЗапрос.DEBT + ВложенныйЗапрос.CHARGE - ВложенныйЗапрос.LASTPAY > 0
	   |				ТОГДА ВложенныйЗапрос.DEBT + ВложенныйЗапрос.CHARGE - ВложенныйЗапрос.LASTPAY
	   |			ИНАЧЕ 0
	   |		КОНЕЦ) КАК SUM,
	   |	ВложенныйЗапрос.LS.ОбъектЛицевогоСчета КАК FLAT,
	   |	ВложенныйЗапрос.LS.Владелец.Ссылка КАК АдресЗдания
	   |ИЗ
	   |	(ВЫБРАТЬ
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.КодПоЕДРПОУ КАК OKPO,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет КАК LS,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК DEBT,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК CHARGE,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК LASTPAY,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация КАК COMPANY,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК ACCOUNT
	   |	ИЗ
	   |		РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	   |				&ДатаНачала,
	   |				&ДатаОкончания,
	   |				Авто,
	   |				,
	   |				ЛицевойСчет.ПометкаУдаления = ЛОЖЬ
	   |					И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд
	   |                    " + Условие + ") КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	   |	
	   |	СГРУППИРОВАТЬ ПО
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.КодПоЕДРПОУ,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию.НомерСчета
	   |	
	   |	ОБЪЕДИНИТЬ ВСЕ
	   |	
	   |	ВЫБРАТЬ
	   |		РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ,
	   |		РасчетыПоЛицевымСчетам.ЛицевойСчет,
	   |		0,
	   |		0,
	   |		0,
	   |		РасчетыПоЛицевымСчетам.Организация,
	   |		РасчетыПоЛицевымСчетам.Организация.БанковскийСчетПоУмолчанию.НомерСчета
	   |	ИЗ
	   |		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	   |	ГДЕ
	   |		РасчетыПоЛицевымСчетам.ЛицевойСчет.ПометкаУдаления = ЛОЖЬ
	   |		И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	   |		И РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд
	   |        " + Условие1 + "
	   |	
	   |	СГРУППИРОВАТЬ ПО
	   |		РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ,
	   |		РасчетыПоЛицевымСчетам.ЛицевойСчет,
	   |		РасчетыПоЛицевымСчетам.Организация,
	   |		РасчетыПоЛицевымСчетам.Организация.БанковскийСчетПоУмолчанию.НомерСчета) КАК ВложенныйЗапрос
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	ВложенныйЗапрос.LS,
	   |	ВложенныйЗапрос.OKPO,
	   |	ВложенныйЗапрос.COMPANY,
	   |	ВложенныйЗапрос.ACCOUNT,
	   |	ВложенныйЗапрос.LS.ОбъектЛицевогоСчета,
	   |	ВложенныйЗапрос.LS.Владелец.Ссылка";

	Запрос.УстановитьПараметр("ДатаНачала", Объект.Период.ДатаНачала);//ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период.ДатаОкончания));//ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1));
	Запрос.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	тест = Запрос.Выполнить().Выгрузить();
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Если Результат.LS.ОбъектЛицевогоСчета.ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой Тогда
			стр = Объект.ДанныеДляВыгрузки.Добавить();
			Адрес = ПолучитьДанныеКИ(Результат.АдресЗдания, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения);
			ЗначенияПолей = ПреобразоватьСтрокуВСписокПолей(Адрес);
			Для Каждого Строки Из ЗначенияПолей Цикл
				Если Строки.Представление <> "Корпус" Тогда
				    стр[Строки.Представление] = Строки.Значение;
				Иначе
					стр.Дом = стр.Дом + " корпус " + Строки.Значение;
				КонецЕсли;
			КонецЦикла;
			стр.PAYERIDENT = Результат.LS;
			стр.FIO = ОтветственныйВладелец(Результат.LS);
			стр.STREET = стр.Улица;
			стр.BUILDING = стр.Дом;
			Позиция = Найти(Результат.FLAT, "№");
			стр.FLAT = Прав(Результат.FLAT, Позиция - 2);
			стр.SERVICE = "Комунальні послуги";
			стр.SERVICECOD = "1";
			стр.LS = Результат.LS;
			стр.YEAR = Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), "ДФ=yyyy");
			стр.MONTH = Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), "ДФ=MM");
			стр.DEBT = Результат.DEBT;
			стр.CHARGE = Результат.CHARGE;
			стр.LASTPAY = Результат.LASTPAY;
			стр.ACCOUNT = Результат.ACCOUNT;
			стр.MFO = "";
			стр.PAYDEST = "Оплата за комунальні послуги";
			стр.SUM = Результат.SUM;
			стр.COMPANY = Результат.COMPANY;
			стр.OKPO = Результат.OKPO;
			стр.COMPANYCOD = Результат.COMPANY.Код;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКИ(Ссылка, ВидКонтактнойИнформации)
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.ЗначенияПолей
		|ИЗ
		|	Справочник." + Ссылка.Метаданные().Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Вид",    ВидКонтактнойИнформации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначенияПолей;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПреобразоватьСтрокуВСписокПолей(СтрокаПолей)
	
	Результат = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	
	Для Итерация = 1 По СтрЧислоСтрок(СтрокаПолей) Цикл
		ПолученнаяСтрока = СтрПолучитьСтроку(СтрокаПолей, Итерация);
		Если Лев(ПолученнаяСтрока, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(ПолученнаяСтрока, 2);
			КонецЕсли;
		Иначе
			ПозицияСимвола = Найти(ПолученнаяСтрока, "=");
			Если ПозицияСимвола <> 0 Тогда
				ПоследнийЭлемент = Результат.Добавить(Сред(ПолученнаяСтрока, ПозицияСимвола + 1), Лев(ПолученнаяСтрока, ПозицияСимвола - 1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получить значения поля адреса.
//
// Параметры:
//	СтрокаЗначенийПолей - строка со значениями полей адреса.
//	ИмяПоля - имя поля. Например, "Район".
// 
// Возвращаемое значение:
//  Строка - значение поля.
//
Функция ПолучитьЗначениеПоляАдреса(СтрокаЗначенийПолей, ИмяПоля) Экспорт
	
	ПозицияПоля = Найти(СтрокаЗначенийПолей, ИмяПоля);
	Значение = "";
	Если ПозицияПоля <> 0 Тогда
		ЗначенияПолей = Прав(СтрокаЗначенийПолей.Представление, СтрДлина(СтрокаЗначенийПолей.Представление) - ПозицияПоля - СтрДлина(ИмяПоля));
		ПозицияПС = Найти(ЗначенияПолей, Символы.ПС);
		Значение = Сред(ЗначенияПолей, 0 ,ПозицияПС - 1);
	КонецЕсли;
	Возврат Значение;

КонецФункции

&НаСервере
Функция ОтветственныйВладелец(ЛС)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
	    |ИЗ
	    |	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
	    |			&НаДату,
	    |			Активность = ИСТИНА
	    |				И ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ОтветственныйВладелец = Результат.ОтветственныйВладелец;
	КонецЦикла;
	Возврат ОтветственныйВладелец;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	Файл = Новый XBase;
	Файл.Кодировка = КодировкаXBase.ANSI;
	Файл.поля.Добавить("PAYERIDENT","C", 50, 0);
	Файл.поля.Добавить("FIO","C", 50, 0);
	Файл.поля.Добавить("STREETCODE","C", 50, 0);
	Файл.поля.Добавить("TOWN","C", 100, 0);
	Файл.поля.Добавить("STREET","C", 100, 0);
	Файл.поля.Добавить("BUILDING","C", 10, 0);
	Файл.поля.Добавить("FLAT","C", 10, 0);
	Файл.поля.Добавить("COMPANY","C", 50, 0);
	Файл.поля.Добавить("OKPO","C", 35, 0);
	Файл.поля.Добавить("COMPANYCOD","C", 15, 0);
	Файл.поля.Добавить("PHONE","C", 20, 0);
	Файл.поля.Добавить("ACCOUNT","C", 34, 0);
	Файл.поля.Добавить("MFO","C", 12, 0);
	Файл.поля.Добавить("SERVICE","C", 50, 0);
	Файл.поля.Добавить("SERVICECOD","C", 15, 0);
	Файл.поля.Добавить("LS","C", 18, 0);
	Файл.поля.Добавить("PAYDEST","C", 160, 0);
	Файл.поля.Добавить("CASHSYMBOL","C", 2, 0);
	Файл.поля.Добавить("MGTARIF_S","N", 13, 2);
	Файл.поля.Добавить("SUM","N", 13, 2);
	Файл.поля.Добавить("YEAR","N", 4, 0);
	Файл.поля.Добавить("MONTH","N", 2, 0);
	Файл.поля.Добавить("DEBT","N", 13, 2);
	Файл.поля.Добавить("CHARGE","N", 13, 2);
	Файл.поля.Добавить("RECALC","N", 13, 2);
	Файл.поля.Добавить("REMISSION","N", 13, 2);
	Файл.поля.Добавить("SUBSIDIES","N", 13, 2);
	Файл.поля.Добавить("LASTPAY","N", 13, 2);
	Файл.поля.Добавить("IDMET1","C", 11, 0);
	Файл.поля.Добавить("EVAL1","N", 15, 0);
	
	Попытка
		Файл.СоздатьФайл(Объект.ФайлDBF);
	Исключение
		Предупреждение("Помилка створення файлу " + Файл);
		Возврат;
	КонецПопытки;
	
	Для Каждого стр1 Из Объект.ДанныеДляВыгрузки Цикл
		Файл.Добавить();
		Файл.PAYERIDENT = стр1.PAYERIDENT;
		Файл.FIO = стр1.FIO;
		Файл.STREETCODE = стр1.STREETCODE;
		Файл.TOWN = стр1.Город;
		Файл.STREET = стр1.STREET;
		Файл.BUILDING = стр1.BUILDING;
		Файл.FLAT = стр1.FLAT;
		Файл.COMPANY = стр1.COMPANY;
		Файл.OKPO = стр1.OKPO;
		Файл.COMPANYCOD = стр1.COMPANYCOD;
		Файл.PHONE = стр1.PHONE;
		Файл.ACCOUNT = стр1.ACCOUNT;
		Файл.MFO = стр1.MFO;
		Файл.SERVICE = стр1.SERVICE;
		Файл.SERVICECOD = стр1.SERVICECOD;
		Файл.LS = стр1.LS;
		Файл.PAYDEST = стр1.PAYDEST;
		Файл.CASHSYMBOL = стр1.CASHSYMBOL;
		Файл.MGTARIF_S = стр1.MGTARIF_S;
		Файл.SUM = стр1.SUM;
		Файл.YEAR = стр1.YEAR;
		Файл.MONTH = стр1.MONTH;
		Файл.DEBT = стр1.DEBT;
		Файл.CHARGE = стр1.CHARGE;
		Файл.RECALC = стр1.RECALC;
		Файл.REMISSION = стр1.REMISSION;
		Файл.SUBSIDIES = стр1.SUBSIDIES;
		Файл.LASTPAY = стр1.LASTPAY;
		Файл.IDMET1 = стр1.IDMET1;
		Файл.EVAL1 = стр1.EVAL1;
		Файл.Записать();
	КонецЦикла;
	
	Файл.ЗакрытьФайл();
	Предупреждение("Файл " + Файл + " успішно створений.");
КонецПроцедуры
